app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars" ORDER BY "cars"."id" ASC
---
  def index
    @cars = Car.all

INSERT INTO "cars" ("name", "registration_number", "servicing_to", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "sssddd"], ["registration_number", "ddd"], ["servicing_to", "2018-02-11"], ["created_at", "2018-02-10 10:53:42.500183"], ["updated_at", "2018-02-10 10:53:42.500183"], ["user_id", 2]]
---
  def create
    hash = {}
    car_params.each { |key, value| hash[key] = value }
    puts car_params.inspect
    @car = Car.new(hash)

    respond_to do |format|
      if @car.save

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "cars" SET "servicing_to" = $1, "created_at" = $2, "updated_at" = $3 WHERE "cars"."id" = $4  [["servicing_to", "2018-01-03"], ["created_at", "2018-01-05 08:38:18.644000"], ["updated_at", "2018-01-05 08:38:18.644000"], ["id", 14]]
---
  def update
    @car = Car.find(car_params[:id])
    hash = {}
    car_params.each { |key, value| hash[key] = value }
    hash.delete('id')
    hash.delete('url')
    respond_to do |format|
      if @car.update(hash)

DELETE FROM "cars" WHERE "cars"."id" = $1  [["id", 1]]
---
  def destroy
    puts @car.inspect
    puts car_params
    @car.destroy