app/controllers/cars_controller.rb

  def index
    @cars = Car.all.where(user_id: current_user.id).order(:id)
---
SELECT "cars".* FROM "cars" WHERE "cars"."user_id" = $1 ORDER BY "cars"."id" ASC  [["user_id", 2]]