app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("name", "firemen_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "xcvvvv"], ["firemen_id", 2], ["created_at", "2018-01-11 21:06:19.560358"], ["updated_at", "2018-01-11 21:06:19.560358"]]

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE "courses" SET "date_course" = $1, "date" = $2, "expiry_date" = $3, "updated_at" = $4 WHERE "courses"."id" = $5  [["date_course", "2018-01-03T23:00:00.000Z"], ["date", "2018-01-01T23:00:00.000Z"], ["expiry_date", "2018-02-07"], ["updated_at", "2018-01-30 09:36:49.931270"], ["id", 4]]