app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = $1 ORDER BY "courses"."id" ASC  [["user_id", 2]]
---
  def index
    @courses = Course.all.where(user_id: current_user.id).order(:id)