app/controllers/departures_controller.rb

SELECT "departures".* FROM "departures" WHERE "departures"."user_id" = $1 ORDER BY "departures"."id" ASC  [["user_id", 2]]
---
  def index
    @departures = Departure.all.where(user_id: current_user.id).order(:id)

INSERT INTO "departures" ("name", "incident_date", "user_id", "note", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "asddd"], ["incident_date", "2018-02-06"], ["user_id", 2], ["note", "ddd"], ["created_at", "2018-02-12 22:32:20.181595"], ["updated_at", "2018-02-12 22:32:20.181595"]]
---
  def create
    @departure = Departure.new(departure_params)

    respond_to do |format|
      if @departure.save