app/controllers/firemen_controller.rb

SELECT "firemen".* FROM "firemen" WHERE "firemen"."user_id" = $1 ORDER BY "firemen"."id" ASC  [["user_id", 2]]
---
  def index
    @firemen = Firemen.all.where(user_id: current_user.id).order(:id)