app/controllers/firemen_controller.rb

SELECT "firemen".* FROM "firemen" ORDER BY "firemen"."id" ASC
---
  def index
    @firemen = Firemen.all

INSERT INTO "firemen" ("name", "surname", "created_at", "updated_at", "second_name", "father_name", "adres") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "asdasd"], ["surname", "asd"], ["created_at", "2017-12-29 08:27:10.366248"], ["updated_at", "2017-12-29 08:27:10.366248"], ["second_name", "asd"], ["father_name", "asd"], ["adres", "asd"]]
---
  def create
    hash = {}
    fireman_params.each { |key, value| hash[key] = value }
    @fireman = Firemen.new(hash)

    respond_to do |format|
      if @fireman.save

SELECT  "firemen".* FROM "firemen" WHERE "firemen"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "firemen" SET "created_at" = $1, "updated_at" = $2, "second_name" = $3, "birth_date" = $4 WHERE "firemen"."id" = $5  [["created_at", "2018-02-10 10:38:58.604000"], ["updated_at", "2018-02-10 10:38:58.604000"], ["second_name", "zxc"], ["birth_date", "1970-01-01"], ["id", 24]]
---
  def update

    @firemen = Firemen.find(fireman_params[:id])
    hash = {}
    fireman_params.each { |key, value| hash[key] = value }
    hash.delete('id')
    hash.delete('url')
    if @firemen.update(hash)

SELECT  "firemen".* FROM "firemen" WHERE "firemen"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def set_fireman
      @fireman = Firemen.find(params[:id])