app/controllers/firemen_controller.rb

  def all
    puts Firemen.all
---
SELECT "firemen".* FROM "firemen"

  def add
    puts 'aaa'
    puts params
    Firemen.create(name: params[:name], surname: params[:surname], email: params[:email])
    render json: Firemen.all
---
INSERT INTO "firemen" ("name", "surname", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "matt"], ["surname", "m"], ["email", "asd@asd.pl"], ["created_at", "2017-08-19 09:44:52.045997"], ["updated_at", "2017-08-19 09:44:52.045997"]]
SELECT "firemen".* FROM "firemen"