app/controllers/medals_controller.rb

  def index
    @medals = Medal.all.where(user_id: current_user.id).order(:id)
---
SELECT "medals".* FROM "medals" WHERE "medals"."user_id" = $1 ORDER BY "medals"."id" ASC  [["user_id", 2]]

  def create

    hash = {}
    medal_params.each { |key, value| hash[key] = value }
    hash[:user_id] = current_user.id
    puts hash
    @medal = Medal.new(hash)

    respond_to do |format|
      if @medal.save
---
INSERT INTO "medals" ("firemen_id", "user_id", "granting_date", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["firemen_id", 2], ["user_id", 2], ["granting_date", "2018-02-05"], ["name", "pierwszy"], ["created_at", "2018-02-12 20:42:23.732362"], ["updated_at", "2018-02-12 20:42:23.732362"]]