app/controllers/medicals_controller.rb

SELECT "medicals".* FROM "medicals" WHERE "medicals"."user_id" = $1 ORDER BY "medicals"."id" ASC  [["user_id", 2]]
---
  def index
    @medicals = Medical.all.where(user_id: current_user.id).order(:id)

INSERT INTO "medicals" ("name", "examination_date", "start_date", "firemen_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "asdasd"], ["examination_date", "2018-01-07"], ["start_date", "2018-01-07"], ["firemen_id", 6], ["created_at", "2017-12-30 15:10:12.731469"], ["updated_at", "2017-12-30 15:10:12.731469"]]
---
  def create

    hash = {}
    medical_params.each { |key, value| hash[key] = value }
    hash[:user_id] = current_user.id
    @medical = Medical.new(hash)

    respond_to do |format|
      if @medical.save

SELECT  "medicals".* FROM "medicals" WHERE "medicals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "medicals" SET "name" = $1, "created_at" = $2, "updated_at" = $3 WHERE "medicals"."id" = $4  [["name", "costam"], ["created_at", "2018-01-13 13:34:30.125000"], ["updated_at", "2018-01-13 13:34:30.125000"], ["id", 19]]
---
  def update
    @medical = Medical.find(medical_params[:id])
    if @medical.user_id == current_user.id
      hash = {}
      medical_params.each { |key, value| hash[key] = value }
      hash.delete('id')
      hash.delete('url')
      respond_to do |format|
        if @medical.update(hash)

SELECT  "medicals".* FROM "medicals" WHERE "medicals"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
    def set_medical
      @medical = Medical.find(params[:id])