app/controllers/medicals_controller.rb

  def index
    @medicals = Medical.all
---
SELECT "medicals".* FROM "medicals"