app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["username", "matt"], ["LIMIT", 1]]
---
  def create
    # user = User.where(:username => params[:session][:username].downcase).first
    user = User.find_by(username: params[:session][:username])